docs/results/api-load.txt
docker : Unable to find image 'grafana/k6:1.3.0' locally
At line:2 char:1
+ docker run --rm --network changeguard_default --mount 'type=bind,sour ...
+ ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
    + CategoryInfo          : NotSpecified: (Unable to find ...:1.3.0' locally:String) [], RemoteException
    + FullyQualifiedErrorId : NativeCommandError
 
1.3.0: Pulling from grafana/k6
4f4fb700ef54: Pulling fs layer
e488bc2c5497: Pulling fs layer
9824c27679d3: Pulling fs layer
14c020c6cf1f: Pulling fs layer
4f4fb700ef54: Already exists
4f4fb700ef54: Pull complete
ecfdb57cf3d2: Download complete
e488bc2c5497: Download complete
9824c27679d3: Download complete
e488bc2c5497: Pull complete
9824c27679d3: Pull complete
14c020c6cf1f: Download complete
14c020c6cf1f: Pull complete
Digest: sha256:3ddc8b1a33a2c3d8edc6e99b6a762ae36cba08788463458f5e6a7703e14eb77d
Status: Downloaded newer image for grafana/k6:1.3.0

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: /scripts/review.js
        output: -

     scenarios: (100.00%) 1 scenario, 2 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 20 iterations shared among 2 VUs (maxDuration: 10m0s, gracefulStop: 30s)


running (00m01.0s), 2/2 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 2 VUs  00m01.0s/10m0s  00/20 shared iters

running (00m02.0s), 2/2 VUs, 2 complete and 0 interrupted iterations
default   [  10% ] 2 VUs  00m02.0s/10m0s  02/20 shared iters

running (00m03.0s), 2/2 VUs, 4 complete and 0 interrupted iterations
default   [  20% ] 2 VUs  00m03.0s/10m0s  04/20 shared iters

running (00m04.0s), 2/2 VUs, 10 complete and 0 interrupted iterations
default   [  50% ] 2 VUs  00m04.0s/10m0s  10/20 shared iters

running (00m05.0s), 2/2 VUs, 14 complete and 0 interrupted iterations
default   [  70% ] 2 VUs  00m05.0s/10m0s  14/20 shared iters


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 40      6.94758/s
    checks_succeeded...: 100.00% 40 out of 40
    checks_failed......: 0.00%   0 out of 40

    ✓ review passes
    ✓ 5000 resources assessed

    HTTP
    http_req_duration..............: avg=549.04ms min=281.39ms med=405.46ms max=1.45s p(90)=896.24ms p(95)=1.45s
      { expected_response:true }...: avg=549.04ms min=281.39ms med=405.46ms max=1.45s p(90)=896.24ms p(95)=1.45s
    http_req_failed................: 0.00% 0 out of 20
    http_reqs......................: 20    3.47379/s

    EXECUTION
    iteration_duration.............: avg=575.66ms min=300.08ms med=428.45ms max=1.49s p(90)=924.07ms p(95)=1.49s
    iterations.....................: 20    3.47379/s
    vus............................: 2     min=2       max=2
    vus_max........................: 2     min=2       max=2

    NETWORK
    data_received..................: 18 kB 3.0 kB/s
    data_sent......................: 11 MB 1.8 MB/s



running (00m05.8s), 0/2 VUs, 20 complete and 0 interrupted iterations
default ✓ [ 100% ] 2 VUs  00m05.8s/10m0s  20/20 shared iters